cf/Catalogs/Картинки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Картинки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Картинки/Ext/ObjectModule.bsl
Процедура СохранитьКартинку(Отказ)
	
	ТекКартинка = Картинка.Получить();
	
	Если ТекКартинка <> Неопределено И НЕ ПустаяСтрока(КэшируемыеФункции.ПолучитьПутьКОблакуЛокально()) Тогда
		
		ИмяФайла = КэшируемыеФункции.ПолучитьПутьКОблакуЛокально() + "\img\" + Код + "." + Расширение;
			
		Попытка
			текКартинка.Записать(ИмяФайла);
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи картинки в облако
			|ИмяФайла = " + ИмяФайла + "
			|" + стрОшибки);
			Отказ = Истина; КонецПопытки; КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ТекКартинка = Картинка.Получить();
	
	Если ТекКартинка <> Неопределено И ТипЗнч(ТекКартинка) = Тип("Картинка") Тогда
		Расширение	= КонвертацияТипов.РасширениеКартинки(текКартинка) КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СохранитьКартинку(Отказ);
	
КонецПроцедуры
